"""
 Квадратный корень из 2 можно записать
в виде бесконечной непрерывной дроби.

√2 = 1 +
           1
    	2 +
            1
          2 +
              1
 	 	 	2 + 1
 	 	 	 	2 + ...

 Бесконечную непрерывную дробь можно записать,
воспользовавшись обозначением √2 = [1;(2)], где (2) указывает на то,
что 2 повторяется до бесконечности.
Подобным образом, √23 = [4;(1,3,1,8)].

 Оказывается, что последовательность частичных значений
непрерывных дробей предоставляет наилучшую рациональную аппроксимацию
квадратного корня. Рассмотрим приближения √2.

  1 + 1/2 = 3/2

  1 + 1    = 7/5
 	 2 + 1
         2

1 + 1       = 17/12
   2 + 1
	  2 + 1
          2

1 + 1           = 41/29
   2 + 1
 	  2 + 1
         2 + 1
             2

 Таким образом, последовательность первых десяти приближений для √2
имеет вид:

 1, 3/2, 7/5, 17/12, 41/29, 99/70, 239/169, 577/408,
1393/985, 3363/2378, ... Самое удивительное,
что важная математическая константа
e = [2; 1,2,1, 1,4,1, 1,6,1 , ... , 1,2k,1, ...].

 Первые десять членов последовательности приближений для e
перечислены ниже:

  2, 3, 8/3, 11/4, 19/7, 87/32, 106/39, 193/71, 1264/465, 1457/536, ...

 Сумма цифр числителя 10-го приближения равна 1 + 4 + 5 + 7 = 17.

 Найдите сумму цифр числителя 100-го приближения
непрерывной дроби для e.
"""


def compute():
    numer = 1
    denom = 0
    for i in reversed(range(100)):
        numer, denom = e_contfrac_term(i) * numer + denom, numer
        
    ans = sum(int(c) for c in str(numer))
    return str(ans)


def e_contfrac_term(i):
    if i == 0:
        return 2
    elif i % 3 == 2:
        return i // 3 * 2 + 2
    else:
        return 1


if __name__ == "__main__":
    print(compute())
